Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.SetPointConstraintType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AdaptivePointConstraintType)
Sets constrain type of an Adaptive Shape Handle Point.
doc:
The Document
refPointId:
The ReferencePoint id
constraintType:
Constraint type of the Adaptive Shape Handle Point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId refPointId does not correspond to a valid ReferencePoint.
-or-
The Element corresponding to ElementId refPointId does not belong to an Adaptive Family.
-or-
The ElementId refPointId does not correspond to a Shape Handle Point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.GetPointConstraintType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets constrain type of an Adaptive Shape Handle Point.
doc:
The Document
refPointId:
The ReferencePoint id
Returns:
Constraint type of the Adaptive Shape Handle Point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId refPointId does not correspond to a valid ReferencePoint.
-or-
The Element corresponding to ElementId refPointId does not belong to an Adaptive Family.
-or-
The ElementId refPointId does not correspond to a Shape Handle Point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.SetPointOrientationType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AdaptivePointOrientationType)
Sets orientation type of an Adaptive Placement Point.
doc:
The Document
refPointId:
The ReferencePoint id
orientationType:
Orientation type of the Adaptive Placement Point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId refPointId does not correspond to a valid ReferencePoint.
-or-
The Element corresponding to ElementId refPointId does not belong to an Adaptive Family.
-or-
The ElementId refPointId does not correspond to an Adaptive Placement Point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.GetPointOrientationType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets orientation type of an Adaptive Placement Point.
doc:
The Document
refPointId:
The ReferencePoint id
Returns:
Orientation type of Adaptive Placement Point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId refPointId does not correspond to a valid ReferencePoint.
-or-
The Element corresponding to ElementId refPointId does not belong to an Adaptive Family.
-or-
The ElementId refPointId does not correspond to an Adaptive Placement Point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.SetPlacementNumber(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32)
Sets Placement Number of an Adaptive Placement Point.
doc:
The Document
refPointId:
The ReferencePoint id
placementNumber:
Placement number of the Adaptive Placement Point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId refPointId does not correspond to a valid ReferencePoint.
-or-
The Element corresponding to ElementId refPointId does not belong to an Adaptive Family.
-or-
The ElementId refPointId does not correspond to an Adaptive Placement Point.
-or-
The number placementNumber is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.GetPlacementNumber(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets Placement number of an Adaptive Placement Point.
doc:
The Document
refPointId:
The ReferencePoint id
Returns:
Placement number of the Adaptive Placement Point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId refPointId does not correspond to a valid ReferencePoint.
-or-
The Element corresponding to ElementId refPointId does not belong to an Adaptive Family.
-or-
The ElementId refPointId does not correspond to an Adaptive Placement Point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.MakeAdaptivePoint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AdaptivePointType)
Makes Reference Point an Adaptive Point or makes an Adaptive Point a Reference Point.
doc:
The Document
refPointId:
The ReferencePoint id
type:
The Adaptive Point Type
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId refPointId does not correspond to a valid ReferencePoint.
-or-
The Element corresponding to ElementId refPointId does not belong to an Adaptive Family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.GetNumberOfShapeHandlePoints(Autodesk.Revit.DB.Family)
Gets number of Shape Handle Point Elements in Adaptive Component Family.
family:
The Family
Returns:
Number of Adaptive Shape Handle Point Element References in the Adaptive Component Family.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Family family is not an Adaptive Component Family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.GetNumberOfPlacementPoints(Autodesk.Revit.DB.Family)
Gets number of Placement Point Elements in Adaptive Component Family.
family:
The Family
Returns:
Number of Adaptive Placement Point Element References in Adaptive Component Family.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Family family is not an Adaptive Component Family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.GetNumberOfAdaptivePoints(Autodesk.Revit.DB.Family)
Gets number of Adaptive Point Elements in Adaptive Component Family.
family:
The Family
Returns:
Number of Adaptive Point Element References in Adaptive Component Family.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Family family is not an Adaptive Component Family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.IsAdaptiveShapeHandlePoint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Verifies if the Reference Point is an Adaptive Shape Handle Point.
doc:
The Document
refPointId:
The ReferencePoint id
Returns:
True if the Point is an Adaptive Shape Handle Point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.IsAdaptivePlacementPoint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Verifies if the Reference Point is an Adaptive Placement Point.
doc:
The Document
refPointId:
The ReferencePoint id
Returns:
True if the Point is an Adaptive Placement Point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.IsAdaptivePoint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Verifies if the Reference Point is an Adaptive Point.
doc:
The Document
refPointId:
The ReferencePoint id
Returns:
True if the Point is an Adaptive Point (Placement Point or Shape Handle Point).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils.IsAdaptiveComponentFamily(Autodesk.Revit.DB.Family)
Verifies if the Family is an Adaptive Component Family.
family:
The Family
Returns:
True if the Family is an Adaptive Component Family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentFamilyUtils
An interface for Adaptive Component Instances.
Since:
2012